tutorials/cases/case_line_interpolation/0.orig/solidU
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      solidU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        //type            fixedValue;
        //value           uniform (0 0 0);
        type            zeroGradient;
    }
    outlet
    {
        //type            fixedValue;
        //value           uniform (0 0 0);
        type            zeroGradient;
    }
    wall
    {
        //type            fixedValue;
        //value           uniform (0 0 0);
        type            zeroGradient;
    }
    axis
    {
        type            zeroGradient;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
